# Функция для дешифрования шифра Цезаря (скопированная из файла с шифром Цезаря)
def decrypt(ciphertext: str, shift: int):
    # Переменная для хранения шифра
    output_text = ""
    # Цикл разбивает по буквам и кодирует
    shift = -shift
    for symbol in ciphertext:
        # Переменная в которой хранится код эл-та
        code_symbol = ord(symbol)
        # "ord" - выдает код эл-та

        # Если при кодировке смещение не выходит за диапазон
        if (32 <= code_symbol <= 126) and (32 <= code_symbol + shift <= 126):
            # "chr" - выдает эл-т соответствующий коду
            output_text += chr(shift + code_symbol)

        # Если при кодировке смещение выходит за диапазон и сдвиг отрицательный
        elif (32 >= code_symbol + shift) and (32 <= code_symbol <= 126):
            output_text += chr(126 - 31 + (shift + code_symbol))
            # +31 т.к. с 32-го начинаются подходящие символы

        # Если при кодировке смещение выходит за диапазон и сдвиг положительный
        elif (code_symbol + shift >= 126) and (32 <= code_symbol <= 126):
            output_text += chr((shift + code_symbol) - 126 + 31)

        else:
            # Если используются символы выходящие за диапазон [32, 126]
            output_text = "Содержит недопустимый символ"
            break

    return output_text


# Словарь с частотой повторения каждой буквы
standard_frequency = {
    " ": 17.1662,
    "e": 10.2911,
    "t": 7.9483,
    "a": 7.4825,
    "o": 7.2201,
    "n": 6.7703,
    "i": 6.3456,
    "s": 6.1473,
    "r": 5.9951,
    "h": 5.2448,
    "l": 4.1253,
    "d": 3.7879,
    "c": 3.3854,
    "u": 2.7584,
    "m": 2.7055,
    "f": 2.4063,
    "p": 2.1885,
    "g": 2.0306,
    "w": 1.9541,
    "y": 1.8510,
    "b": 1.8194,
    "v": 1.0077,
    "k": 0.9678,
    "x": 0.1923,
    "j": 0.1533,
    "q": 0.0957,
    "z": 0.0776,
    "E": 0.6492,
    "T": 0.5976,
    "A": 0.5801,
    "O": 0.5043,
    "N": 0.4920,
    "I": 0.4653,
    "S": 0.4301,
    "R": 0.4200,
    "H": 0.3853,
    "L": 0.3201,
    "D": 0.2852,
    "C": 0.2725,
    "U": 0.1901,
    "M": 0.1782,
    "F": 0.1512,
    "P": 0.1403,
    "G": 0.1252,
    "W": 0.1201,
    "Y": 0.1152,
    "B": 0.1052,
    "V": 0.0721,
    "K": 0.0652,
    "X": 0.0452,
    "J": 0.0352,
    "Q": 0.0252,
    "Z": 0.0201,
    ",": 1.2345,
    ".": 1.1201,
    '"': 0.8654,
    "'": 0.7543,
    "?": 0.4521,
    "!": 0.3521,
    ":": 0.2854,
    ";": 0.2154,
    "-": 0.1854,
    "(": 0.1452,
    ")": 0.1452,
    "[": 0.0452,
    "]": 0.0452,
    "{": 0.0252,
    "}": 0.0252,
    "<": 0.0152,
    ">": 0.0152,
    "/": 0.1254,
    "\\": 0.0152,
    "|": 0.0102,
    "`": 0.0854,
    "~": 0.0152,
    "@": 0.0352,
    "#": 0.0452,
    "$": 0.0854,
    "%": 0.0452,
    "^": 0.0152,
    "&": 0.0552,
    "*": 0.0652,
    "_": 0.0954,
    "+": 0.0352,
    "=": 0.0452,
    "0": 1.2345,
    "1": 0.9854,
    "2": 0.7543,
    "3": 0.4521,
    "4": 0.3521,
    "5": 0.2854,
    "6": 0.2154,
    "7": 0.1854,
    "8": 0.1452,
    "9": 0.1252,
}


# Функция для автоматической дешифровки
def hack(ciphertext: str):
    # Переменная в которой будет храниться дешифрованный текст
    output_text = ["", 0, 0]
    # Перебор сдвигов
    for shift in range(1, 25 + 1):
        # Возможный текст
        possible_text = decrypt(ciphertext, shift)
        # Шанс данного текста
        chance_text = 0
        # Цикл, который проверяет шанс данной расшифровки
        for symbol in possible_text:
            chance_text += standard_frequency[symbol]
        # Сравнение вероятности с наиболее вероятной расшифровкой
        if chance_text > output_text[2]:
            # Обновление наиболее вероятной расшифровки
            output_text[0] = possible_text
            output_text[2] = chance_text
            output_text[1] = shift

    return tuple(output_text[:2])
